Tekla Open API Reference for Tekla Structures 2025
AnalysisEccentricity.End Property
 The eccentricity at the end.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector End { get; }
Public ReadOnly Property End As Vector
	Get
Property Value
Type: Vector
See Also
Reference
AnalysisEccentricity Class
Tekla.Structures.Analysis Namespace